html/dotnet/csharp.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2021-03-09 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>C#/.net</title>
<meta name="generator" content="Org mode">
<meta name="author" content="孙悟空">
<link rel='stylesheet' href='/html/asset/common.css?3344' />
<link rel='stylesheet' href='/yaoliusan/html/asset/common.css?3344' />

</head>
<body>
<div id="content">
<header>
<h1 class="title">C#/.net</h1>
</header><nav id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org1e1e29c">1. 开发方式</a>
<ul>
<li><a href="#orgb57b8ad">1.1. 原始方式</a></li>
<li><a href="#org9685c4e">1.2. 解锁开发的完全能力 (Visual Studio)</a></li>
<li><a href="#org6408e60">1.3. 跨平台开发 (.net core + vscode)</a></li>
</ul>
</li>
</ul>
</div>
</nav>
<p>
历史:
</p>
<ul class="org-ul">
<li>1998 年左右，Java 风靡世界。面向对象，一次编译处处运行 (解决了 C++ 之类的一些痛点)</li>
<li>微软基于 Java 搞出了一个 J++ 的东西。陷入官司。推出了 C# 语言</li>
<li>因此，C# 借鉴了很多语言: Java/C++/Pascal&#x2026;
<ul class="org-ul">
<li>摸着 Java 过河，很多坑被 Java 踩过之后，不需要再踩</li>
<li>微软专有的，历史包袱，开发成本相对低多了</li>
</ul></li>
<li>.net framework，微软在 Windows 上的专有技术，C# 的发挥受限于 .net 平台</li>
<li>.net core 从 .net framework 中被剥离出来，成为开源、免费、跨平台的解决方案</li>
<li>.net5，自此合二为一</li>
</ul>

<section id="outline-container-org1e1e29c" class="outline-2">
<h2 id="org1e1e29c"><span class="section-number-2">1</span> 开发方式</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-orgb57b8ad" class="outline-3">
<h3 id="orgb57b8ad"><span class="section-number-3">1.1</span> 原始方式</h3>
<div class="outline-text-3" id="text-1-1">
<p>
安装完 Windows 之后，自带的 csc 在 C:\Windows\Microsoft.NET\版本号 下面。
</p>

<p>
所以，可以使用记事本等任何顺手的文本编辑器，创建并打开编辑一个 Hello.cs 的文件:
</p>
<div class="org-src-container">
<pre class="src src-csharp"><span style="color: #a020f0;">namespace</span> <span style="color: #a0522d;">Hello</span> <span style="color: #707183;">{</span>
    <span style="color: #a020f0;">class</span> <span style="color: #228b22;">Test</span> <span style="color: #7388d6;">{</span>
        <span style="color: #a020f0;">static</span> <span style="color: #228b22;">void</span> <span style="color: #0000ff;">Main</span><span style="color: #909183;">()</span> <span style="color: #909183;">{</span>
            System.Console.<span style="color: #0000ff;">WriteLine</span><span style="color: #709870;">(</span><span style="color: #8b2252;">"hello, csharp"</span><span style="color: #709870;">)</span>;
        <span style="color: #909183;">}</span>
    <span style="color: #7388d6;">}</span>
<span style="color: #707183;">}</span>
</pre>
</div>

<p>
接下来，就可以编译，并运行了:
</p>
<pre class="example">
C:\Windows\...\csc.exe Hello.cs
Hello.exe
</pre>
</div>
</div>

<div id="outline-container-org9685c4e" class="outline-3">
<h3 id="org9685c4e"><span class="section-number-3">1.2</span> 解锁开发的完全能力 (Visual Studio)</h3>
<div class="outline-text-3" id="text-1-2">
<p>
如果在 Windows 下面进行开发的话。最好的环境就是 VS。
</p>

<p>
三个版本:
</p>
<ol class="org-ol">
<li>社区版</li>
<li>专业版</li>
<li>企业版</li>
</ol>
</div>
</div>

<div id="outline-container-org6408e60" class="outline-3">
<h3 id="org6408e60"><span class="section-number-3">1.3</span> 跨平台开发 (.net core + vscode)</h3>
<div class="outline-text-3" id="text-1-3">
<p>
Java:
</p>
<ul class="org-ul">
<li>jdk (Java Development Kit) 开发包</li>
<li>jre (Java Runtime Environment)  运行环境</li>
<li>eclipse</li>
</ul>

<p>
使用 .net core 开发:
</p>
<ul class="org-ul">
<li>下载并安装 .net core 的 runtime + sdk</li>
<li>安装 VSCode 并安装 C# 的插件</li>
</ul>
</div>
</div>
</section>
</div>
<div id="postamble" class="status">
<p class="author">Author: 孙悟空</p>
<p class="date">Created: 2021-03-09</p>
<p class="validation">Go ahead, never stop.</p>
</div>
</body>
</html>
